addons/binding/org.openhab.binding.ihc.test/src/test/resources/ResourceValueNotificationsResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:waitForResourceValueChanges2 xmlns:ns1="utcs">
<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">10454030</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns2="utcs.values"  xsi:type="ns2:WSDateValue">
<ns2:day xsi:type="xsd:byte">28</ns2:day>

<ns2:month xsi:type="xsd:byte">9</ns2:month>

<ns2:year xsi:type="xsd:short">2018</ns2:year>
</ns1:value>
</ns1:arrayItem>

<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">10454541</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns3="utcs.values"  xsi:type="ns3:WSTimeValue">
<ns3:hours xsi:type="xsd:int">10</ns3:hours>

<ns3:minutes xsi:type="xsd:int">20</ns3:minutes>

<ns3:seconds xsi:type="xsd:int">30</ns3:seconds>
</ns1:value>
</ns1:arrayItem>

<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">10447883</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns4="utcs.values"  xsi:type="ns4:WSIntegerValue">
<ns4:integer xsi:type="xsd:int">456789</ns4:integer>

<ns4:maximumValue xsi:type="xsd:int">2147483647</ns4:maximumValue>

<ns4:minimumValue xsi:type="xsd:int">-2147483648</ns4:minimumValue>
</ns1:value>
</ns1:arrayItem>

<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">4133210</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns5="utcs.values"  xsi:type="ns5:WSBooleanValue">
<ns5:value xsi:type="xsd:boolean">false</ns5:value>
</ns1:value>
</ns1:arrayItem>

<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">3988827</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns6="utcs.values"  xsi:type="ns6:WSBooleanValue">
<ns6:value xsi:type="xsd:boolean">true</ns6:value>
</ns1:value>
</ns1:arrayItem>

<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">4159252</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns7="utcs.values"  xsi:type="ns7:WSFloatingPointValue">
<ns7:maximumValue xsi:type="xsd:double">1000.0</ns7:maximumValue>

<ns7:minimumValue xsi:type="xsd:double">-1000.0</ns7:minimumValue>

<ns7:floatingPointValue xsi:type="xsd:double">24.5</ns7:floatingPointValue>
</ns1:value>
</ns1:arrayItem>

<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">3515401</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns8="utcs.values"  xsi:type="ns8:WSWeekdayValue">
<ns8:weekdayNumber xsi:type="xsd:int">2</ns8:weekdayNumber>
</ns1:value>
</ns1:arrayItem>

<ns1:arrayItem xsi:type="ns1:WSResourceValueEnvelope">
<ns1:resourceID xsi:type="xsd:int">7419663</ns1:resourceID>

<ns1:isValueRuntime xsi:type="xsd:boolean">true</ns1:isValueRuntime>

<ns1:typeString xsi:type="xsd:string"></ns1:typeString>

<ns1:value xmlns:ns9="utcs.values"  xsi:type="ns9:WSEnumValue">
<ns9:definitionTypeID xsi:type="xsd:int">4236359</ns9:definitionTypeID>

<ns9:enumValueID xsi:type="xsd:int">4236872</ns9:enumValueID>

<ns9:enumName xsi:type="xsd:string">testVal</ns9:enumName>
</ns1:value>
</ns1:arrayItem>
</ns1:waitForResourceValueChanges2>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>